{"programming": {"pr1": {"title": "Hello World", "requirement": "Write a code that outputs 'Hello World'", "image": "no", "comments": {"areg": []}}, "pr2": {"title": "Sum of all Primes Smaller than the Input", "requirement": "Write a code that outputs the sum of all prime numbers smaller than the input. For example, if you have inserted the number 10, the output should be 2+3+5+7=17 ", "image": "no"}}, "physics": {"phys1": {"title": "Basic Circuit Problem", "requirement": "The circuit, shown in the figure, consists of a capacitor with the capacitance C = 100 μF, an ideal diode, a constant voltage source U = 10.0 V, three identical resistors with the resistance R = 10.0 kΩ and a switch. At the initial moment, the capacitor is not charged and the switch is open. When the switch is shorted, the current through the diode goes for the time interval τ = 462 ms, and then stops. 1. Find the current through the diode immediately after shorting the switch. 2. Find the total charge that has flowed through the diode.", "image": "yes", "comments": {"areg": []}}, "phys2": {"title": "Isothermal atmosphere", "requirement": "In the atmosphere, the lowest near-surface layer has an almost constant temperature, as it is heated up by the surface of the Earth. Therefore, we assume that the temperature of the atmosphere remains the same over its entire altitude and is equal to T_0=293 К, and the air pressure at the Earth's surface is p_0=1.013∙10^5  Pa. Assume that the acceleration of gravity g=9.81 m/s^2 is independent of the altitude above the Earth's surface, since the total height of the atmosphere is much less than the Earth's radius R_E=6400 km. The universal gas constant is R=8.31 J/(mole∙K). 1 Find and calculate the mass M of the Earth's atmosphere.2 Find and calculate the air pressure p_H at the altitude of H=1500 m above the Earth's surface. ", "image": "no", "comments": {"areg": []}}}, "mathematics": {"math1": {"title": "Metacarpal Bone", "requirement": "The first metacarpal bone is located in the wrist. The scatterplot shows the relationship between the length of the first metacarpal bone and height for 9 people. The line of best fit is also shown.How many of the nine people have an actual height that differs by more than 3 centimeters from the height predicted by the line of best fit?", "image": "yes"}, "math2": {"title": "Three Graphs", "requirement": "A system of three equations and their graphs in the xy-plane are as shown in the figure. How many solutions does the system have?", "image": "yes"}}}